Revit 2024 API
TaskDialog Members
The TaskDialog type exposes the following members.
Constructors
Name | Description
TaskDialog
 Creates a task dialog with title.
Methods
Name | Description
AddCommandLink(TaskDialogCommandLinkId, String)
 Adds a CommandLink associated to the given id, displaying the indicating main content.
AddCommandLink(TaskDialogCommandLinkId, String, String)
 Adds a CommandLink associated to the given id, displaying the indicating main and supporting content.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
EnableDoNotShowAgain
 Enables the "Do not show again" for a task dialog.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Show()
 Shows the task dialog.
Show(String, String)
 Shows a task dialog with title, main instruction and a Close button.
Show(String, String, TaskDialogCommonButtons)
 Shows a task dialog with title, main instruction and common buttons.
Show(String, String, TaskDialogCommonButtons, TaskDialogResult)
 Shows a task dialog with title, main instruction, common buttons and default buttons.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
WasExtraCheckBoxChecked
 Gets the status of the extra checkbox.
WasVerificationChecked
 Gets the status of the verification checkbox.
Properties
Name | Description
AllowCancellation
 Whether the task dialog can be cancelled if no cancel button is specified.
CommonButtons
 The push buttons displayed in the task dialog.
DefaultButton
 The default button for the dialog.
EnableMarqueeProgressBar
 Enables a marquee style progress bar to be displayed in the TaskDialog.
ExpandedContent
 ExpandedContent is hidden by default and will display at the bottom of the task dialog when the "Show details" button is pressed.
ExtraCheckBoxText
 ExtraCheckBoxText is used to label the extra checkbox.
FooterText
 FooterText is used in the footer area of the task dialog.
Id
 The Id of the task dialog.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
MainContent
 MainContent is the smaller text that appears just below the main instructions.
MainIcon
 The icon shown in the task dialog.
MainInstruction
 The large primary text that appears at the top of a task dialog.
Title
 Title of the task dialog.
TitleAutoPrefix
 Whether the TaskDialog's title will automatically have the add-in name added as a prefix.
VerificationText
 VerificationText is used to label the verification checkbox.
See Also
TaskDialog Class
Autodesk.Revit.UI Namespace